export interface Poem {
  title: string;
  line: string;
  meaning?: string;
}

export interface Book {
  booktitle: string;
  booktitle_tanglish?: string; // Added tanglish field based on the new data
  coverimage?: string;
  description?: string;
  category?: string;
  context: Poem[];
}

export interface Author {
  author: string;
  contact?: string;
  books: Book[];
}

export const poemsData: Author[] = [
  {
    author: "jothi",
    contact: "sanand03072005@gamil.com",
    books: [
      {
        booktitle: "இன்பமில்லா-இதயத்திலிருந்து",
        booktitle_tanglish: "inbamilla-ithayathilirundhu",
        description: "சாதிக்க தூதிக்கும் ஒரு சாதாரண மாணவன்",
        category: "Feelings",
        context: [
          {
            title: "God-Murugan-Song",
            line: "பிறப்பிலும் முருகனை, இறப்பிலும் இறைவனை, அனைத்திலும் அவனை கொண்டு இனிதே தொடங்குவோம்!.",
            meaning: "எனது பிறப்பிலும் முருகனை, எனது இறப்பிலும் அவனை, எனது வாழ்வின் ஒவ்வொரு கட்டத்திலும் அவனை நினைத்து இனிதே தொடங்குவோம்!."
          },
          {
            title: "God-Murugan-Song",
            line: "முருகா முருகா வேல் முருகா, என் குறைகளை கேட்க வா முருகா, வேலா வேலா வெற்றிவேலா, உன் வேலினை கொண்டு காத்திடப்பா, அப்பா அப்பா அப்பப்பா, நீ அப்பனுக்கும் அப்பனப்பா, கருணையோ கருணை உன் கருணை, ஒரு தாய் மனம் கொண்ட கருனையப்பா, கந்தா கந்தா கதிர்வேலழகா, நாங்கள் பாடிடுவோம் உன் நாமத்தையே, இறுதிவரை நீ துணையிருப்பாயே.",
            meaning: "முருகா முருகா வேல் முருகா, என் குறைகளை கேட்க வா முருகா, வேலா வேலா வெற்றிவேலா, உன் வேலினை கொண்டு காத்திடப்பா, அப்பா அப்பா அப்பப்பா, நீ அப்பனுக்கும் அப்பனப்பா, கருணையோ கருணை உன் கருணை, ஒரு தாய் மனம் கொண்ட கருனையப்பா, கந்தா கந்தா கதிர்வேலழகா, நாங்கள் பாடிடுவோம் உன் நாமத்தையே, இறுதிவரை நீ துணையிருப்பாயே."
          },
          {
            title: "Mother-Love",
            line: "தாலாட்டில் வளர்ந்தவன், தனிமையில் வளரும் கொடுமைகளை, வார்த்தையில் சொல்ல இயலாது.",
            meaning: "தாயின் மடியில் நன்காக, அன்பாக வளர்க்கப்பட்ட ஒரு குழந்தை, பிறகு தனிமையில் வளர நேரிடும் போது எதிர்கொள்ளும் வேதனைகள் மற்றும் துன்பங்களை வார்த்தைகளால் விவரிக்க முடியாது. அந்த அனுபவம் மிகுந்த மன வேதனையைக் கொடுக்கும்."
          },
          {
            title: "Mother-Love",
            line: "தாங்கி தாங்கி ஊட்டுகையில், தெரியாத அன்பு, தனிமையில் தெரிகிறது.",
            meaning: "தாயின் அன்பு என்றென்றும் தரப்படுவதால், அதை நாம் அதிகம் உணராமல் போகிறோம். ஆனால், தாயின் அன்பும் பராமரிப்பும் இல்லாமல் தனிமையில் நாம் வாழ நேரிடும் போது தான், அந்த அன்பின் மதிப்பு உண்மையாகப் புரிகிறது. அப்போது தான், தாங்கி தாங்கி வளர்த்த தாயின் அன்பை உணரமுடிகிறது."
          },
          {
            title: "Life-Pain",
            line: "ஒளிர்வது தவரென்று, சிறிது நேரத்தில் அழியும், ஆனால் தவறுகள் செய்யாமல், தண்டனை ஏனோ?.",
            meaning: "மெழுகுவர்த்தி கூறுவது போல உவமையாக இந்த கவிதை எழுதப்பட்டுள்ளது. மெழுகுவர்த்தி ஒளிர்வது தவறு என்று நினைத்தால், மற்றவர்களுக்கு வெளிச்சம் கிடைக்காது, அது தான் அழிந்துவிடுவோம் என்று தெரிந்தும், தன்னை வறுத்தி மற்றவர்களுக்காக ஒளி தருகிறது, அப்படி தான் இந்த உலகில் பல மெழுகுவர்த்திகள் உள்ளது. ஆனால், தவறுகள் செய்யாமல், அவர்களுக்கு தண்டனை ஏன் கிடைக்கிறது?."
          },
          {
            title: "Life-Pain",
            line: "இரவு எனும் பெரும்பொழுதினை நீ அறிய, வேதனை எனும் கடலில் முழ்கிப்பார்...",
            meaning: "இந்த உலகில் எதுவுமே பிடிக்காமல் இருக்கும் ஒருவனுக்கு தெரியும், இரவு எனும் பெரும்பொழுது கடல் போன்றது என்று."
          },
          {
            title: "Friend-Love",
            line: "அடிக்கடி வார்த்தை வழியாக, வாழ்க்கையில் வலி தரும், என் அன்பு தோழா, உன் எண்ணத்தை எனக்கு விவரிப்பாயா...",
            meaning: "அடிக்கடி வார்த்தைகள் மூலம், வாழ்க்கையில் வலி தரும் என் அன்பு தோழா, உன் எண்ணத்தை எனக்கு விவரிப்பாயா?."
          },
          {
            title: "Sister-Love",
            line: "என் அன்பு தங்கையே!, நீ நான் தேடாமல் வந்த தேவதை!, என்னிடம் பேசாமல் இருப்பதற்கு காரணம், இப்பொழுது என் மேல் பாசம் இல்லையா?, இல்லை பணம் இல்லையா?.",
            meaning: "என் அன்பான தங்கையே, நீ தேடாமல் வந்த ஒரு தேவதை போன்றவள். ஆனால் இப்போது என்னிடம் பேசாமல் இருப்பதற்கான காரணம் என்ன? இப்போது உனக்குப் என் மேல் பாசம் குறைந்துவிட்டதா? இல்லை என்னிடம் பணம் இல்லையென்பதாலா?"
          },
          {
            title: "Sister-Love",
            line: "உடன்பிறப்பே!, தாய் முகத்திற்கு பின், உன் முகம் தானேடி பார்த்து ரசித்தேன், இப்பொழுது என் முகம் பார்க்க பிடிக்கவில்லையா?.",
            meaning: "என் உயிரின் பாகமே! தாயின் முகத்திற்குப் பிறகு எனக்குச் சிரிப்பும் சந்தோஷமும் கொடுத்த முகம் உன்னுடையதே. நான் உன்னை ஒவ்வொரு நாளும் பார்வையிட்டு ரசித்து வந்தேன். இப்பொழுது என்னுடைய முகத்தை நீ காண விரும்பவில்லையா? அந்த பழைய பாசத்தை நான் இழந்துவிட்டேனா?"
          },
          {
            title: "Book-Love",
            line: "நான் கற்க விரும்பும் போது கிடைக்காத நீ!, நான் விரும்பாத போது விருந்தளிக்கின்றாயே, உண்மையில் நீ பொக்கிஷம் தான்!.",
            meaning: "நான் தேடி தேடி கற்க விரும்பும் போது, எனக்கு கிடைக்காத நீ! நான் விரும்பாத போது மட்டும் என்னிடம் வந்து விருந்தளிக்கிறாய். உண்மையில் நீ பொக்கிஷம் தான்!."
          },
          {
            title: "Book-Love",
            line: "பசிகளை மறந்து, புத்தகம் தேடும் மனது பெற்ற, என் வறுமையின் நிறம் சிவப்பு!.",
            meaning: "உண்ணும் உணவினை கூட மறந்து, புத்தகங்களை தேடும் மனம் பெற்ற, என் வறுமையின் நிறம் சிவப்பு!."
          },
          {
            title: "Book-Love",
            line: "என் வலிகளை மறக்க, மருந்தென உன்னை கண்டேன்!, உன் பக்கத்தினால், என் வாழ்க்கை பக்கத்தை மாற்ற விரும்புகிறேன்!.",
            meaning: "வாழ்க்கையில் இருக்கும் என் வலிகளை அனைத்தையும் மறக்க, மருந்தென உன்னை கண்டேன். புத்தகமே உன் பக்கத்தினால் என் வாழ்க்கை பக்கத்தை மாற்ற விரும்புகிறேன்!."
          },
          {
            title: "Love",
            line: "யாரை பார்த்தும் மயங்காதவன், உன்னை பார்த்து மயங்கிவித்தேனடி, உன் அழகினை பார்த்தேனே தவிர, உன் நெகிழ்ந்த உள்ளத்தை பார்க்க, மறந்துவிட்டேனடி!.",
            meaning: "நான் ஒருபோதும் எவரையும் பார்த்து மயங்கியதில்லை, ஆனால் உன்னைப் பார்த்தவுடன் என் மனமே மயங்கிவிட்டது. அந்த மயக்கத்தை உன் அழகே தந்தது. ஆனால் ஒரு தவறு செய்துவிட்டேன்… உன் வெளிப்புற அழகை மட்டும் பார்த்தேன், ஆனால் அந்த அழகுக்குப் பின்னிலிருக்கும் நெகிழ்ந்த, நசுங்கிய உள்ளத்தை பார்க்க… நான் மறந்துவிட்டேன்…இப்போது அது என் மனதுக்கு வலி தருகிறது."
          },
          {
            title: "Love",
            line: "என் கவிதைகளை கேட்டும், நீ மெளனமாய் நிற்கின்றாய், என் உள்ளத்தை உன்னால், புரிந்து கொள்ள முடியவில்லையா, என் அன்பு காதலியே?.",
            meaning: "நான் உன் காதுக்குச் செவியாய் என் கவிதைகள் ஓலிக்கச் சொன்னேன்… அவற்றில் நான் சொல்லாத வார்த்தைகளும் இருந்தன… அந்தக் கவிதைகளை நீ கேட்டபோதும், நீ ஏன் மெளனமாய் நிற்கிறாய்? நான் உன்னிடம் வெளிப்படுத்த முயன்ற என் உள்ளத்தின் உணர்வுகளை. உன்னால் உணர முடியவில்லையா? என் அன்பும், என் உண்மை காதலும், உனக்கு புரியவில்லையா? என் உயிரே?"
          },
          {
            title: "Life-Pain",
            line: "காந்தியை கேட்கும் உலகத்தில், காமராசன் இன்று யாருமில்லையே!.",
            meaning: "இன்றைய உலகம் எல்லாம் 'காந்தி'யை — அதாவது பணத்தை — மட்டுமே கேட்கும் ஒரு நிலைக்குள் வீழ்ந்துவிட்டது. பணம் இல்லாமல் எதுவும் நடக்காது என்று மக்கள் நம்புகிறார்கள். ஆனால், கல்வியையும் ஒழுக்கத்தையும் அளிக்க கூடிய காமராசர் போன்ற தன்னலமற்ற தலைவர்கள் இன்று இல்லை. பணம் என்ற சொத்தை வளர்ப்பதற்காக, கல்வி என்ற பொதுநல சேவை மறக்கப்பட்டுவிட்டது. கல்வியை இலவசமாக தரும் மனமுடையோர் இல்லை."
          },
          {
            title: "Love",
            line: "சூரியனை போல் தினமும், உன் முகம் பார்த்தேனடி, இன்று சூரியன் இல்லா பூமிப்போல, மனம் வலிக்குதடி!.",
            meaning: "தினமும் சூரியனை பார்ப்பது போல், உன் முகத்தை பார்த்து ரசித்தேன். ஆனால் இன்று சூரியன் இல்லாத பூமி போல, என் மனம் வலிக்கிறது. நீ இல்லாததால்."
          },
          {
            title: "Father-Love",
            line: "உதடுகள் விரும்பவில்லை என்று உரைத்தாலும், உள்ளம் அப்பா என்றே எதிரொலிக்கின்றது!.",
            meaning: "என் உதடுகள் விரும்பவில்லை என்று உரைத்தாலும், என் உள்ளம் அப்பா என்றே எதிரொலிக்கின்றது."
          },
          {
            title: "Father-Love",
            line: "கண்ணாடி போல் எனக்கு, கற்பித்த தந்தையே, என்னை தனிமையில் கதறவிட்டு, சென்றது என்னோ?.",
            meaning: "எனக்கு அனைத்தையும் கண்ணாடி போல கற்பித்த தந்தையே, என்னை தனிமையில் கதறவிட்டு சென்றது என்னோ?."
          },
          {
            title: "Life-Pain",
            line: "விரும்பாமல் விலகியது, விரோதி என்றில்லை விரக்தியில்!.",
            meaning: "நான் விரும்பாமல் விலகியது, விரோதி என்றில்லை விரக்தியில் தான்."
          },
          {
            title: "Father-Love",
            line: "உங்கள் முகம் பாராமல், இரவுகள் அனைத்தும், இனிமையாக இல்லை அப்பா!.",
            meaning: "அப்பா, உங்கள் முகத்தை ஒரு நாள் கூட பார்க்காமல் இருந்தது இல்லை. ஆனால் இப்பொழுது அதனை காணாமல், இரவுகள் அனைத்தும் இனிமையாக இல்லை."
          },
          {
            title: "Life-Pain",
            line: "வலிகள் ஆறாமல், கடல் அலை போல், மீண்டும் மீண்டும் வரும், மரண வலிகள் வாழ்க்கையில், ஆயிரம்!.",
            meaning: "வாழ்க்கையில் ஒருமுறை ஏற்பட்ட வலி நீங்குவதற்குள், கடல் அலை போலவே, மீண்டும் மீண்டும் வலிகள் வந்து அடிக்கிறது. இந்த வலிகள் சாதாரணமானது அல்ல, ஒவ்வொன்றும் மரண வலிகளாக உள்ளது. சற்று சுவாசமெடுக்க கூட நேரமில்லாமல், வலி மறுபடியும் அலையாய் வருகிறது."
          },
          {
            title: "Life-Pain",
            line: "எவர் பிரச்சனை, கேட்டாலும் புரியாது, எல்லாம் தனக்கு வரும், வரை தான் தோழா!.",
            meaning: "மற்றவர்கள் பிரச்சனை கேட்டாலும் புரியாது, எல்லாம் தனக்கு வந்தால் தான் புரியும் தோழரே!."
          },
          {
            title: "Life-Pain",
            line: "இரவின் பொழுதுகள் ஓயாமல், தனிமை எனும் கடலில், தினமும் தத்தளிக்கின்றேன்!.",
            meaning: "வலிகளால் உரக்கம் இல்லாமல், இரவின் பொழுதுகளும் ஓயாமல், தனிமை எனும் கடலில், தினமும் தத்தளிக்கின்றேன்."
          },
          {
            title: "Love",
            line: "மழை துளிகளில், மலரென அருகில் வந்தேன், வந்த பின் மெளனம் கொண்டேன்!.",
            meaning: "அழகான மழையில், மலரென நினைத்து உன் அருகில் வந்தேன், வந்த பின் தான் தெரிகிறது நீ என்று. ஆனால் அருகில் வந்த பின் மெளனம் கொண்டேன் உன் அழகினால்."
          },
          {
            title: "Life-Pain",
            line: "உறவுகள் பிரிந்த வாழ்க்கையில், உறக்கமின்றி உளறுகின்றேன், ஊக்கம் வேண்டும் என்று!.",
            meaning: "உறவுகளை பிரிந்த வாழ்க்கையில், உறக்கமின்றி தூக்கத்தில் உளறுகின்றேன், ஊக்கம் வேண்டும் என்று."
          },
          {
            title: "Life-Pain",
            line: "என் தலையணையில், தடைகளை எண்ணி தவழ்ந்த, இருள் இரவுகள் கோடி!.",
            meaning: "என் தலையணையில், வாழக்கை தடைகளை எண்ணி தூங்காமல் இருந்த, இருள் இரவுகள் கோடி!"
          },
          {
            title: "Mother-Love",
            line: "என் சிறுவயது முதல், முத்தை காக்கும் சிற்பி போல, என்னை காக்கும் அழகியே தேவியே! உன்னை காண நான் வருகிறேன், காத்திரு!.",
            meaning: "என் சிறுவயது முதல், முத்தை போல என்னை காத்த அழகியே தேவியே, உங்களை நான் காண வருகிறேன். காத்திருங்கள் அம்மா."
          },
          {
            title: "Mother-Love",
            line: "தேவதையே, என் ஆரம்ப காலம், முதல் இருக்கும் உன்னால், என் இறுதி காலம் வரை, இருக்க முடியாது என்று அறியும் போது, நெஞ்சம் வலிக்குதடி!.",
            meaning: "நான் பிறந்ததிலிருந்து இருந்த உங்களால், என் இறுதி காலம் வரை இருக்க முடியாது என்று அறியும்போது, என் நெஞ்சம் வலிக்கிறது."
          },
          {
            title: "Mother-Love",
            line: "காலம் என் கட்டுக்குள்ளிருந்தால், எப்பொழுதோ உன்பin திரிந்த, இனிமையான காலம் சென்றிருப்பேனே!.", // Corrected typo 'ன்பin' to 'உன்பின்'
            meaning: "காலத்தை என் கட்டுக்குள் வைக்க முடிந்திருந்தால், எப்பொழுதோ உங்கள் பின்னே திரிந்த இனிமையான காலம் சென்றிருப்பேனே."
          },
          {
            title: "Life-Pain",
            line: "இனிமை இல்லாத தனிமையில், தவிக்கும் இருள் அடைந்த, வாழ்க்கையில் வாழ்வது பொய், அதற்கு இறப்பே சிறப்பு!.",
            meaning: "சந்தோஷம் இல்லாமல், தனிமையாக, இருளில் வாழ்வது பொய். அதற்கு பதிலாக இறப்பதே சிறந்தது"
          },
          {
            title: "Life-Pain",
            line: "இந்த பறந்த உலகத்தில், பட்டாம்பூச்சிபோல பறக்க முடியாததை எண்ணி, உறங்காமல் தவித்த நாட்கள், எண்ணற்றவை...",
            meaning: "என் இஷ்டத்திற்கு பட்டாம்பூச்சிபோல பறக்க முடியாததை எண்ணி, உறங்காமல் தவித்த நாட்கள் எண்ணற்றவை..."
          },
          {
            title: "Life-Pain",
            line: "கஷ்டம் எனும் இலையூதிர்காலம் பின் தான், வெற்றி எனும் பொற்காலம் தானாக வரும்!.",
            meaning: "ஒன்றை அடைய வேண்டுமென்றால், கஷ்டம் எனும் இலையூதிர்காலத்தை அனுபவித்தால் தான், வெற்றி எனும் பொற்காலம் தானாக வரும்."
          },
          {
            title: "Family-Love",
            line: "துள்ளி துள்ளி வரவேற்று, கடல் அலை போன்ற மெளனத்தில் வழி அனுப்பும், என் உறவே...",
            meaning: "அரவறத்துதன் என்னை வரவேற்று, அமைதியாக வழி அனுப்பும், என் உறவே..."
          },
          {
            title: "Love",
            line: "இரும்பான என் இதயத்தை, இளகாக மாற்றிய உன்னை காண்பது எப்போது?.",
            meaning: "இரும்பான என் இதயத்தை, மென்மையாக மாற்றிய உன்னை காண்பது எப்போது?."
          },
          {
            title: "Love",
            line: "இமைப்பொழுதில் உன் முகம் வந்து செல்கிறது, என் மனதில், நீ எப்பொழுது வருவாய்?",
            meaning: "என் மனதில், இமைப்பொழுதில் உன் முகம் வந்து செல்கிறது, ஆனால் நீ எப்பொழுது நேரில் வருவாய்?"
          },
          {
            title: "Love",
            line: "கற்றறிபவனே கவிஞனாக்கினாய், ஆனால், உன் காதலனாக்குவது எப்பொழுது?",
            meaning: "எதை பற்றியும் யோசிக்காமல் படிப்பவனை கவிஞனாக்கினாய், ஆனால் என்னை உன் காதலனாக்குவது எப்போது?"
          },
          {
            title: "Love",
            line: "அரசனே ஆண்டியாக்கும் உன் சிரிப்பு, என்னை ஊமையாக்கியது பெரிய விஷயம் இல்லை.",
            meaning: "உன் சிரிப்பினால் அரசனே ஆண்டியாகிவிடுவான், அதனால் நான் ஊமையாகியது பெரிய விஷயம் இல்லை."
          }
        ]
      },
    ]
  },
  {
    author: "rajthambu",
    contact: "rthambu@gmail.com",
    books: [
      {
        booktitle: "வாழ்த்து",
        booktitle_tanglish: "Festival Greetings",
        description: "New Year, Diwali & Monsoon greetings in the form of Tamil Poetry",
        category: "Greetings",
        context: [
          {
            title: "Tamil-New-Year-Greetings",
            line: "புதிது புதிது என புத்தாண்டில் புனைவது யேன்? அதில் புதியது எது? புரியாதது எது?\n\nபெரிது பெரிது என பேசும் பொழுது,\nசிரியது எது வென சிந்திப்பது புதிது…\n\nபொருள் பெருக்குவது எவ்வாறு என பொழுது போக்குவதற்க்கு முன்,\nஉனக்கு உரியது எது வென உணர்வது புதிது…\n\nகுருகிய கோட்பாடுகளை காணொலி கழகத்தில் கற்பிக்கும்முன்,\nநெடிய பாதையின் நெரிமுறைகளை நெஞில் அமர்த்துவது புதிது….\n\nதெரியும் என திமிராய் திரிவதை விட,\nதெரியாது என்ற தெளிவான பக்குவம் அடைதல் புதிது…\n\nபுதியது எது வாயின்,\nபழம் பொருளை நன்கு அரிவது புதிது !",
            meaning: "புத்தாண்டில் புதிய விஷயங்களை புனைவதை விட, பழைய விஷயங்களை நன்கு அறிவது புதியது. பெரிய விஷயங்களை பேசுவதை விட, சிறிய விஷயங்களை சிந்திப்பது புதியது. பொருளை பெருக்குவதற்கு முன், உனக்கு உரியது எது என்பதை உணர்வது புதியது. குறுகிய கோட்பாடுகளை கற்பிக்கும் முன், நெடிய பாதையின் நெறிமுறைகளை நெஞ்சில் அமர்த்துவது புதியது. தெரியும் என திமிராய் திரிவதை விட, தெரியாது என்ற தெளிவான பக்குவம் அடைதல் புதியது."
          },
          {
            title: "Deepavali-Greetings",
            line: "திரியும் எண்ணயும் அகலில் புகலிட,\nதிரியும் எண்ணமும் அகத்திடம் வெளியிட ।\n\nதீப ஒளி வரிசையை பக்தியுடன் காண,\nதீய விழி மீட்க்கும் சக்தியுடன் பேண ।\n\nபளபளப்பு ஆடையுடன் பட்டாசு தெரிக்க,\nபளிச்சுடன் வீசும் பால் வண்ணப் பாங்குடன்।\n\nநலம் தரும் திரு நாளில்,\nநாவில் சிரிப்பும், நாள் தோரும் இன்பமும் பெருக,\nஇனிய நல் தீபாவளி வாழ்த்துக்கள் !!!",
            meaning: "தீபாவளி விழாவில், தீப ஒளியுடன் பக்தியுடன் வணங்கி, தீய எண்ணங்களை அகற்றி, நல்ல எண்ணங்களை வளர்த்து, பளபளப்பான ஆடைகளுடனும் பட்டாசுகளுடனும் கொண்டாடி, இன்பமும் சிரிப்பும் நிறைந்த தீபாவளி வாழ்த்துக்கள்."
          },
          {
            title: "Monsoon-Rain-Greetings",
            line: "ஓடும் நதி போல் நீ,\nஓட்டின் அதிபதி நீ,\nபாரின் வண்ணம் நீ,\nபார்க்கும் எண்ணம் நீ,\nபுவி பார்த்த அருவி துளி நீ,\nகவி வார்த்த கருவியும் நீ.\n\nவிண் தூண்டிவிட்ட விதையா நீ,\nஎன் கண்ணை மூடிவிட்ட கதையா நீ ?",
            meaning: "மழை என்பது ஓடும் நதி போலவும், பூமியின் வண்ணமாகவும், புவியை பார்த்த அருவி துளியாகவும், கவிஞனின் கருவியாகவும் இருக்கிறது. விண்ணில் இருந்து வரும் விதை போலவும், கண்ணை மூடிவிட்ட கதை போலவும் இருக்கிறது."
          }
        ]
      },
      {
        booktitle: "பொங்கல் வாழ்த்து",
        booktitle_tanglish: "Pongal Vaazhthu",
        description: "A song on pongal festival",
        category: "Greetings",
        context: [
          {
            title: "Pongal-Greetings",
            line: "பொங்கலோ பொங்கல், தை பொங்கல் |\nவிதைத்து விளைத்து காணும் பொங்கல் ।\nபொங்கலோ பொங்கல், தை பொங்கல் ||\n\nகருவடைந்த காணி நிலத்தின் பயிரை |\nபேணி காத்த பெருமிகு உழவர் |\nஅதன், அறுவடை காணும் அகமகிழ் பொன் நாள் |\nஅதுவே, தமிழர் கொண்டாடும் தை பொங்கல் திருநாள் ||\n\nநன் கோலம் இட்ட |\nபொன் ஆரம் சூட்ட |\nஜல்லி காளை கட்ட |\nஇம்மண்ணின் பொன் விழா ||\n\nஎண் திசை கூடி |\nபண் இசை பாடி |\nபொன் சிலம்பு ஆடி |\nஒன்றி கூடும் விழா |\nஅதுவே, தமிழரின் தை பொங்கல் திருவிழா ||\n\nஇந்த புண்ணிய பூமி அளித்த பூசு மஞளும் |\nஅந்த கன்னி வயல் கொடுத்த கொத்து கரும்பும் |\nஎந்த வரம்பு மீரா வைத்த அருசுவை உணவும் |\nபந்தமிகு உறவுகளோடு பகிர்ந்து மகிழ்ந்த வண்ணம் |\nஅதுவே, தமிழர் கொண்டாடும் தை பொங்கல் தினம் ||\n\nஉழுதுண்டு வாழ்வாரைத் தொழுதுண்டு பின்செல்|\nஎன வழி கொண்ட பெருமானுக்கு,\nஒரு மானம் காட்டும் தினம் |\nஅதுவே, தமிழ் அன்னை பெற்ற வள்ளுவர் தினம் ||\n\nஅன்று போதியில் தெரித்த கேள்வி |\nஇன்று போகியில் எரித்த வேள்வி |\nஎன்று தமிழர் கணித்த நாள் |\nஅதுவே,\nஇனித்த பொங்கல் திருநாள் ||\n\nநல்லோர் ராசியும்,\nநம் முன்னோர் ஆசியும்,\nவைத்து தொழுக ஒருநாள் ||\n\nதிருமண்ணில் நீர் சேர்த்து,\nதிருநீரில் மண் சேர்த்து,\nதமிழ் வேதம் ஓதும் திருநாள் |\nஅதுவே,\nதமிழர் வணங்கும் தை பொங்கல் பெரு நாள் ||\n\nபொங்கலோ பொங்கல், தை பொங்கல் |",
            meaning: "தை பொங்கல் என்பது தமிழர்களின் முக்கியமான விவசாய விழா. விதைத்து விளைத்து அறுவடை செய்யும் உழவர்களின் மகிழ்ச்சியை கொண்டாடும் நாள். கோலம் இட்டு, ஆரம் சூட்டி, காளையை கட்டி, எண் திசையிலிருந்தும் கூடி, பண் இசை பாடி, சிலம்பு ஆடி ஒன்று கூடும் விழா. புண்ணிய பூமி அளித்த பூசு மஞள், கரும்பு, அருசுவை உணவு ஆகியவற்றை உறவுகளோடு பகிர்ந்து கொள்ளும் நாள். உழுதுண்டு வாழ்வாரைத் தொழுதுண்டு பின்செல் என வள்ளுவர் வழி கொண்ட பெருமானுக்கு மானம் காட்டும் தினம். திருமண்ணில் நீர் சேர்த்து, திருநீரில் மண் சேர்த்து, தமிழ் வேதம் ஓதும் திருநாள்."
          }
        ]
      }
    ]
  }
];